{
  "ir_version": "0.1",
  "language": "java",
  "repo_root": "/Users/grantoie/Documents/Code/repos/context-slicer/test-fixtures/order-service",
  "adapter_version": "0.1.0",
  "scenario": {
    "name": "submit-order",
    "entry_points": []
  },
  "files": [
    {
      "id": "f01",
      "path": "src/main/java/com/contextslice/fixture/MockPaymentService.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f02",
      "path": "src/main/java/com/contextslice/fixture/OrderController.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f03",
      "path": "src/main/java/com/contextslice/fixture/OrderRequest.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f04",
      "path": "src/main/java/com/contextslice/fixture/OrderResponse.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f05",
      "path": "src/main/java/com/contextslice/fixture/OrderService.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f06",
      "path": "src/main/java/com/contextslice/fixture/OrderServiceApplication.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f07",
      "path": "src/main/java/com/contextslice/fixture/PaymentRequest.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f08",
      "path": "src/main/java/com/contextslice/fixture/PaymentResult.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f09",
      "path": "src/main/java/com/contextslice/fixture/PaymentService.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f10",
      "path": "src/main/java/com/contextslice/fixture/StripeOrderService.java",
      "language": "java",
      "hash": "sha256:"
    },
    {
      "id": "f11",
      "path": "src/main/java/com/contextslice/fixture/StripePaymentService.java",
      "language": "java",
      "hash": "sha256:"
    }
  ],
  "symbols": [
    {
      "id": "java::com.contextslice.fixture.MockPaymentService",
      "kind": "class",
      "name": "MockPaymentService",
      "language": "java",
      "file_id": "f01",
      "line_start": 6,
      "line_end": 18,
      "visibility": "public",
      "annotations": [
        "@Service",
        "@Profile"
      ],
      "is_entry_point": false,
      "is_framework": true,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.MockPaymentService::charge(PaymentRequest)",
      "kind": "method",
      "name": "charge",
      "language": "java",
      "file_id": "f01",
      "line_start": 14,
      "line_end": 17,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.MockPaymentService",
      "annotations": [
        "@Override"
      ],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderController",
      "kind": "class",
      "name": "OrderController",
      "language": "java",
      "file_id": "f02",
      "line_start": 7,
      "line_end": 19,
      "visibility": "public",
      "annotations": [
        "@RestController",
        "@RequestMapping"
      ],
      "is_entry_point": false,
      "is_framework": true,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderController::createOrder(OrderRequest)",
      "kind": "method",
      "name": "createOrder",
      "language": "java",
      "file_id": "f02",
      "line_start": 14,
      "line_end": 18,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderController",
      "annotations": [
        "@PostMapping"
      ],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest",
      "kind": "class",
      "name": "OrderRequest",
      "language": "java",
      "file_id": "f03",
      "line_start": 3,
      "line_end": 17,
      "visibility": "public",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest::getAmount()",
      "kind": "method",
      "name": "getAmount",
      "language": "java",
      "file_id": "f03",
      "line_start": 15,
      "line_end": 15,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest::getCustomerId()",
      "kind": "method",
      "name": "getCustomerId",
      "language": "java",
      "file_id": "f03",
      "line_start": 9,
      "line_end": 9,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest::getProductId()",
      "kind": "method",
      "name": "getProductId",
      "language": "java",
      "file_id": "f03",
      "line_start": 11,
      "line_end": 11,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest::getQuantity()",
      "kind": "method",
      "name": "getQuantity",
      "language": "java",
      "file_id": "f03",
      "line_start": 13,
      "line_end": 13,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest::setAmount(double)",
      "kind": "method",
      "name": "setAmount",
      "language": "java",
      "file_id": "f03",
      "line_start": 16,
      "line_end": 16,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest::setCustomerId(String)",
      "kind": "method",
      "name": "setCustomerId",
      "language": "java",
      "file_id": "f03",
      "line_start": 10,
      "line_end": 10,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest::setProductId(String)",
      "kind": "method",
      "name": "setProductId",
      "language": "java",
      "file_id": "f03",
      "line_start": 12,
      "line_end": 12,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderRequest::setQuantity(int)",
      "kind": "method",
      "name": "setQuantity",
      "language": "java",
      "file_id": "f03",
      "line_start": 14,
      "line_end": 14,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderResponse",
      "kind": "class",
      "name": "OrderResponse",
      "language": "java",
      "file_id": "f04",
      "line_start": 3,
      "line_end": 17,
      "visibility": "public",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderResponse::\u003cinit\u003e(String, String, String)",
      "kind": "constructor",
      "name": "OrderResponse",
      "language": "java",
      "file_id": "f04",
      "line_start": 8,
      "line_end": 12,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderResponse",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderResponse::getOrderId()",
      "kind": "method",
      "name": "getOrderId",
      "language": "java",
      "file_id": "f04",
      "line_start": 14,
      "line_end": 14,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderResponse",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderResponse::getPaymentRef()",
      "kind": "method",
      "name": "getPaymentRef",
      "language": "java",
      "file_id": "f04",
      "line_start": 16,
      "line_end": 16,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderResponse",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderResponse::getStatus()",
      "kind": "method",
      "name": "getStatus",
      "language": "java",
      "file_id": "f04",
      "line_start": 15,
      "line_end": 15,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderResponse",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderService",
      "kind": "interface",
      "name": "OrderService",
      "language": "java",
      "file_id": "f05",
      "line_start": 3,
      "line_end": 9,
      "visibility": "public",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderService::createOrder(OrderRequest)",
      "kind": "method",
      "name": "createOrder",
      "language": "java",
      "file_id": "f05",
      "line_start": 8,
      "line_end": 8,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderService",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderServiceApplication",
      "kind": "class",
      "name": "OrderServiceApplication",
      "language": "java",
      "file_id": "f06",
      "line_start": 6,
      "line_end": 11,
      "visibility": "public",
      "annotations": [
        "@SpringBootApplication"
      ],
      "is_entry_point": false,
      "is_framework": true,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.OrderServiceApplication::main(String[])",
      "kind": "method",
      "name": "main",
      "language": "java",
      "file_id": "f06",
      "line_start": 8,
      "line_end": 10,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.OrderServiceApplication",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentRequest",
      "kind": "class",
      "name": "PaymentRequest",
      "language": "java",
      "file_id": "f07",
      "line_start": 3,
      "line_end": 17,
      "visibility": "public",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentRequest::\u003cinit\u003e(String, double, String)",
      "kind": "constructor",
      "name": "PaymentRequest",
      "language": "java",
      "file_id": "f07",
      "line_start": 8,
      "line_end": 12,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentRequest::getAmount()",
      "kind": "method",
      "name": "getAmount",
      "language": "java",
      "file_id": "f07",
      "line_start": 15,
      "line_end": 15,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentRequest::getCurrency()",
      "kind": "method",
      "name": "getCurrency",
      "language": "java",
      "file_id": "f07",
      "line_start": 16,
      "line_end": 16,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentRequest::getCustomerId()",
      "kind": "method",
      "name": "getCustomerId",
      "language": "java",
      "file_id": "f07",
      "line_start": 14,
      "line_end": 14,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentRequest",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentResult",
      "kind": "class",
      "name": "PaymentResult",
      "language": "java",
      "file_id": "f08",
      "line_start": 3,
      "line_end": 17,
      "visibility": "public",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentResult::\u003cinit\u003e(boolean, String, String)",
      "kind": "constructor",
      "name": "PaymentResult",
      "language": "java",
      "file_id": "f08",
      "line_start": 8,
      "line_end": 12,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentResult",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentResult::getErrorMessage()",
      "kind": "method",
      "name": "getErrorMessage",
      "language": "java",
      "file_id": "f08",
      "line_start": 16,
      "line_end": 16,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentResult",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentResult::getTransactionId()",
      "kind": "method",
      "name": "getTransactionId",
      "language": "java",
      "file_id": "f08",
      "line_start": 15,
      "line_end": 15,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentResult",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentResult::isSuccess()",
      "kind": "method",
      "name": "isSuccess",
      "language": "java",
      "file_id": "f08",
      "line_start": 14,
      "line_end": 14,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentResult",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentService",
      "kind": "interface",
      "name": "PaymentService",
      "language": "java",
      "file_id": "f09",
      "line_start": 3,
      "line_end": 9,
      "visibility": "public",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.PaymentService::charge(PaymentRequest)",
      "kind": "method",
      "name": "charge",
      "language": "java",
      "file_id": "f09",
      "line_start": 8,
      "line_end": 8,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.PaymentService",
      "annotations": [],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.StripeOrderService",
      "kind": "class",
      "name": "StripeOrderService",
      "language": "java",
      "file_id": "f10",
      "line_start": 9,
      "line_end": 30,
      "visibility": "public",
      "annotations": [
        "@Service"
      ],
      "is_entry_point": false,
      "is_framework": true,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "kind": "method",
      "name": "createOrder",
      "language": "java",
      "file_id": "f10",
      "line_start": 15,
      "line_end": 29,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.StripeOrderService",
      "annotations": [
        "@Override",
        "@Transactional"
      ],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.StripePaymentService",
      "kind": "class",
      "name": "StripePaymentService",
      "language": "java",
      "file_id": "f11",
      "line_start": 7,
      "line_end": 23,
      "visibility": "public",
      "annotations": [
        "@Service"
      ],
      "is_entry_point": false,
      "is_framework": true,
      "is_generated": false
    },
    {
      "id": "java::com.contextslice.fixture.StripePaymentService::charge(PaymentRequest)",
      "kind": "method",
      "name": "charge",
      "language": "java",
      "file_id": "f11",
      "line_start": 13,
      "line_end": 22,
      "visibility": "public",
      "container": "java::com.contextslice.fixture.StripePaymentService",
      "annotations": [
        "@Override"
      ],
      "is_entry_point": false,
      "is_framework": false,
      "is_generated": false
    }
  ],
  "call_edges": [
    {
      "caller": "java::com.contextslice.fixture.MockPaymentService::charge(PaymentRequest)",
      "callee": "java::com.contextslice.fixture.PaymentResult",
      "static": true,
      "runtime_observed": false,
      "call_count": 0
    },
    {
      "caller": "java::com.contextslice.fixture.OrderController::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.OrderService::createOrder(OrderRequest)",
      "static": true,
      "runtime_observed": false,
      "call_count": 0
    },
    {
      "caller": "java::com.contextslice.fixture.OrderController::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "static": false,
      "runtime_observed": true,
      "call_count": 1
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.OrderRequest::getAmount()",
      "static": true,
      "runtime_observed": true,
      "call_count": 1
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.OrderRequest::getCustomerId()",
      "static": true,
      "runtime_observed": true,
      "call_count": 1
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.OrderResponse",
      "static": true,
      "runtime_observed": false,
      "call_count": 0
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.PaymentRequest",
      "static": true,
      "runtime_observed": false,
      "call_count": 0
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.PaymentResult::getErrorMessage()",
      "static": true,
      "runtime_observed": false,
      "call_count": 0
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.PaymentResult::getTransactionId()",
      "static": true,
      "runtime_observed": true,
      "call_count": 1
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.PaymentResult::isSuccess()",
      "static": true,
      "runtime_observed": true,
      "call_count": 1
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.PaymentService::charge(PaymentRequest)",
      "static": true,
      "runtime_observed": false,
      "call_count": 0
    },
    {
      "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
      "callee": "java::com.contextslice.fixture.StripePaymentService::charge(PaymentRequest)",
      "static": false,
      "runtime_observed": true,
      "call_count": 1
    },
    {
      "caller": "java::com.contextslice.fixture.StripePaymentService::charge(PaymentRequest)",
      "callee": "java::com.contextslice.fixture.PaymentResult",
      "static": true,
      "runtime_observed": false,
      "call_count": 0
    }
  ],
  "runtime": {
    "observed_symbols": [
      {
        "symbol_id": "java::com.contextslice.fixture.OrderController::createOrder(OrderRequest)",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.OrderRequest::getAmount()",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.OrderRequest::getCustomerId()",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.OrderRequest::setAmount(double)",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.OrderRequest::setCustomerId(String)",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.OrderResponse::getOrderId()",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.OrderResponse::getPaymentRef()",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.OrderResponse::getStatus()",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.OrderServiceApplication::main(String[])",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.PaymentResult::getTransactionId()",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.PaymentResult::isSuccess()",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
        "call_count": 1
      },
      {
        "symbol_id": "java::com.contextslice.fixture.StripePaymentService::charge(PaymentRequest)",
        "call_count": 1
      }
    ],
    "observed_edges": [
      {
        "caller": "java::com.contextslice.fixture.OrderController::createOrder(OrderRequest)",
        "callee": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
        "call_count": 1
      },
      {
        "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
        "callee": "java::com.contextslice.fixture.OrderRequest::getAmount()",
        "call_count": 1
      },
      {
        "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
        "callee": "java::com.contextslice.fixture.OrderRequest::getCustomerId()",
        "call_count": 1
      },
      {
        "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
        "callee": "java::com.contextslice.fixture.PaymentResult::getTransactionId()",
        "call_count": 1
      },
      {
        "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
        "callee": "java::com.contextslice.fixture.PaymentResult::isSuccess()",
        "call_count": 1
      },
      {
        "caller": "java::com.contextslice.fixture.StripeOrderService::createOrder(OrderRequest)",
        "callee": "java::com.contextslice.fixture.StripePaymentService::charge(PaymentRequest)",
        "call_count": 1
      }
    ]
  }
}